dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32-diag-headless
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.esp32.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Original ESP32 has no assist-debug module
# (SOC_ASSIST_DEBUG_SUPPORTED is unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD
# isn't available here -- pair with the end-of-stack hardware watchpoint for
# deterministic (not sampled-at-context-switch) detection. See
# components/bb_health/Kconfig.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h. Every
# env in the CI smoke matrix sets this; without it, bb_http.c's own
# -Werror'd #warning fails the build (unrelated to this env's B1-1336 gate).
CONFIG_LWIP_SO_LINGER=y
# B1-1336 compile-gate: both bb_diag_http route surfaces OFF. Both
# bb_diag_routes_init()/bb_diag_sections_init() have `// bbtool:init` markers
# in bb_wire.h, so codegen emits unconditional calls regardless of these
# Kconfig values -- this env proves that headless (both routes compiled out)
# still links, i.e. bb_diag_http.h's declarations stay unconditional and
# each definition's own #if body gates to a no-op stub when off (see
# components/bb_diag_http/CMakeLists.txt + platform/espidf/bb_diag_http/
# bb_diag_http_routes.c + bb_diag_http_section_dispatch.c).
CONFIG_BB_DIAG_ROUTES=n
CONFIG_BB_DIAG_SECTIONS=n

# B1-1482: same pin as sdkconfig.defaults.esp32 -- this board also only ever
# composes 2 genuinely-blocking clients (SSE+WS, examples/smoke/main/
# bb_wire.h), so pin the blocking-client budget to that real usage rather
# than letting it silently track the new CONFIG_BB_DATA_HTTP_MAX_CLIENTS
# default of 3 (which would trip bb_data_http_espidf.c's compile-time
# guard: 3*20=60ms >= the 50ms default sweep interval).
CONFIG_BB_DATA_HTTP_MAX_BLOCKING_CLIENTS=2
